{
  "education": [
    {
      "awards_achievements": [
        "Campaign for the New Millennium Scholarship",
        "Ruth Leith Award in Classical Music Performance",
        "Graduated with Great Distinction.",
        "GPA: 4.14/4.30"
      ],
      "degree": "Bachelor of Fine Arts, Specialization in Music Composition",
      "department": "Music Theory and Composition",
      "duration": "2017-2020",
      "school_name": "Concordia University, Montreal"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_CatalinaGalan",
  "highlighted_projects": [
    {
      "description": "Frontrow is a social platform where fans can find, rate and review concerts, as well as interact, follow and connect with other fans. This was the final team project at Le Wagon bootcamp. The app was deployed in Heroku and developed with Ruby on Rails in a two week Agile sprint. As a participant in this project I collaborated in building the back-end schema and databases with PostgreSQL; created front-end elements with SCSS and Stimulus; and implemented the chat feature in its entirety.",
      "git_url": "https://github.com/catagalan-mtl/frontrow-cat",
      "name": "Frontrow"
    },
    {
      "description": "This website was developed as a personal project to showcase my work. It is a fully responsive website built from a single page template and transformed into a rails app with a PostgreSQL database, deployed in Heroku. I have modified and restructured the original open source code to support my needs and preferences by: creating objects for each project and facilitating any update process; implementing a new custom design with CSS and Stimulus for JavaScript; and adding new features such as show pages and media for each project.",
      "git_url": "https://github.com/catagalan-mtl/my-portfolio",
      "name": "My Portfolio"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The Linux Cluster Monitoring Agent app is designed to record hardware specifications and usage information from multiple nodes in a Linux Cluster. It collects usage data from each node in real time and stores it in a RDBMS. The app was created for the Jarvis Linux Cluster Administration (LCA), to manage a cluster of 10 nodes internally connected through a switch. The team needs to record information and track the usage of each machine in the network.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "SQL (Structured Query Language) is a specialized language widely used when handling data. The objective of this project it to practice SQL and RDBMS by solving SQL queries.",
      "git_url": "/sql",
      "name": "RDBSM and SQL"
    },
    {
      "description": [
        "Grep App: This Java app mimics the functionality of the Linux command 'grep', which is used to search for a string or regex pattern within a file and returns all lines that contain the match. This app is designed to be run directly in the command line, outputting the results to a given file.",
        "JDBC App: Implementing JDBC, OkHttpHelper and PostgreSQL, the Stock Quote App is designed to simulate buying and selling stock based on real time data fetched from the Alpha Vantage API."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Catalina Galan Vargas",
  "others": [
    {
      "bullets": [
        "Winner of the Concordia Composition Competition in 2018."
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Member of OPCM classical choir. Contralto voice.",
        "Was a member of the organizing committee for the Women in Music Conference in Concordia University, 2018.",
        "Volunteered as a band coach for Rock Camp Montreal in 2021, a summer camp for female and non-gendered youth."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Le Wagon Montreal",
      "description": "Conduct occasional introductory programming workshops to teach foundational coding skills to beginners in JavaScript and Ruby.",
      "duration": "2024 - ongoing",
      "title": "Guest lecturer"
    },
    {
      "company": "Bellow Media",
      "description": "Contributed in building a new SaaS software solution application with Bullet Train and Ruby on Rails. Implemented multiple project features and worked in frontend with Tailwind.",
      "duration": "2023 - July 2024",
      "title": "Junior Software Developer"
    },
    {
      "company": "Studio Artease",
      "description": "Specialized in designing and executing custom ornamental detail oriented blackwork designs, working one on one with hundreds of clients. Managed independent business as an artist, working on schedules, finances, certifications, client communications and bookings. Created a professional brand and strong online presence with over 1500 followers on Instagram @galantattoo and participated successfully in multiple conventions in Chile and Canada.",
      "duration": "2016 - 2023",
      "title": "Tattoo Artist"
    },
    {
      "company": "Independent",
      "description": "Composed and orchestrated original music. Winner of Concordia Composition Competition with 'Transition', premiered at Oscar Peterson Hall, Montreal, by the Orchestre Symphonique de l'Isle (OSI) in March 2018. Composed and produced scores for short films and dance performances collaborating with choreographers and directors. Wrote string arrangements for songwriters and other musicians.",
      "duration": "2018 - 2022",
      "title": "Composer, Sound Designer and Orchestrator"
    }
  ],
  "skills": {
    "competent": [
      "SQL/PostgreSQL",
      "Docker",
      "Maven",
      "Linux/Bash",
      "JavaScript",
      "HTML/CSS",
      "Tailwind"
    ],
    "familiar": [
      "Spring Boot",
      "GCP",
      "AWS",
      "Python",
      "React"
    ],
    "proficient": [
      "Ruby",
      "Ruby on Rails",
      "Java",
      "Agile/Scrum",
      "Git/GitHub"
    ]
  },
  "summary": "I am a deeply curious individual and a dedicated lifelong learner. With a background in the arts and music, I earned my bachelor's degree in Music Composition, graduating with Great Distinction. In 2023 I successfully completed a Web Development bootcamp and have been continuing to learn and collaborate in projects ever since. Fascinated by both the arts and sciences, I continually seek opportunities to challenge my abilities and foster intellectual growth. My interest in software development stems from a strong desire to expand my knowledge and pursue a new, challenging career path. I am enthusiastic about the future of this journey and am eager to grow and excel in this industry."
}
